Revit 2024 API
ParameterTypeId.WallSweepCutsWallParam Property
 "Cuts Wall"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId WallSweepCutsWallParam { get; }
Visual Basic
Public Shared ReadOnly Property WallSweepCutsWallParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ WallSweepCutsWallParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace